Revit 2024 API
PartMakerMethodToDivideVolumes.IsElementValidIntersectingReference Method (ElementId)
 Identifies if the provided member is valid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool IsElementValidIntersectingReference(
	ElementId elementId
)
Visual Basic
Public Function IsElementValidIntersectingReference ( _
	elementId As ElementId _
) As Boolean
Visual C++
public:
bool IsElementValidIntersectingReference(
	ElementId^ elementId
)
Parameters
elementId
Type: Autodesk.Revit.DB.ElementId
 Element ids to be tested for validity for intersecting references.
Return Value
 True if the reference is valid, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
PartMakerMethodToDivideVolumes Class
IsElementValidIntersectingReference Overload
Autodesk.Revit.DB Namespace